tap "1password/tap"
tap "aquaproj/aqua"
tap "armosec/kubescape"
tap "cue-lang/tap"
tap "derailed/k9s"
tap "fluxcd/tap"
tap "go-task/tap"
tap "hashicorp/tap"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
brew "age"
brew "ansible"
brew "argon2"
brew "bat"
brew "openjdk@11"
brew "bazel"
brew "cilium-cli"
brew "curl"
brew "direnv"
brew "duf"
brew "emacs"
brew "exa"
brew "fd"
brew "fish"
brew "fisher"
brew "fzf"
brew "git"
brew "git-gui"
brew "go"
brew "helm"
brew "jq"
brew "k3d"
brew "kind"
brew "kopia"
brew "kubernetes-cli"
brew "kustomize"
brew "minikube"
brew "minio-mc"
brew "mysql-client"
brew "openjdk"
brew "peco"
brew "pgcli"
brew "pre-commit"
brew "prettier"
brew "protobuf"
brew "redis"
brew "ripgrep"
brew "shellcheck"
brew "sops"
brew "watch"
brew "wget"
brew "yq"
brew "zx"
brew "aquaproj/aqua/aqua"
brew "cue-lang/tap/cue"
brew "derailed/k9s/k9s"
brew "fluxcd/tap/flux"
brew "go-task/tap/go-task"
brew "hashicorp/tap/terraform"
cask "1password-cli"
cask "iina"
