# Do not edit this file in ~/.config/homebrew/Brewfile. Edit the version in chezmoi source.
#

tap "arl/arl"
tap "fluxcd/tap"
tap "waydabber/betterdisplay"

brew "age"
brew "atuin"
brew "bat"
brew "chezmoi"
brew "coreutils"
brew "curl"
brew "direnv"
brew "doggo"
brew "duf"
brew "eza"
brew "fd"
brew "findutils"
brew "fish"
brew "fisher"
brew "fzf"
brew "gawk"
brew "gh"
brew "git-delta"
brew "git"
brew "gnu-sed"
brew "go-task"
brew "go"
brew "gopls"
brew "gpg2"
brew "htop"
brew "jj"
brew "jq"
brew "lazygit"
brew "lazyjj"
brew "lua-language-server"
brew "minijinja-cli"
brew "mise"
brew "neovim"
brew "pre-commit"
brew "prettier"
brew "ripgrep"
brew "sesh"
brew "shellcheck"
brew "shfmt"
brew "sops"
brew "starship"
brew "stylua"
brew "tmux"
brew "tpm"
brew "watch"
brew "wget"
brew "yamllint"
brew "yq"
brew "zoxide"

{{ if (eq .chezmoi.hostname "hera") }}
brew "k9s"
brew "kubernetes-cli"
brew "talosctl"
{{ end }}

{{ if (eq .chezmoi.os "darwin") }}
brew "mas"
brew "pinentry-mac"
brew "pam-reattach"

brew "arl/arl/gitmux"

cask "1password"
cask "1password-cli"
cask "font-dejavu-sans-mono-nerd-font"
cask "font-fira-code-nerd-font"
cask "font-jetbrains-mono-nerd-font"
cask "font-sf-mono"
cask "hyperkey"

{{ end }}

{{ if (or (eq .chezmoi.hostname "Odin") (eq .chezmoi.hostname "odin")) }}
brew "actionlint"
brew "aichat"
brew "argc"
brew "bacon"
brew "bacon-ls"
brew "cilium-cli"
brew "colima"
brew "docker"
brew "docker-compose"
brew "gum"
brew "helm-docs"
brew "helm-ls"
# brew "helm"
# brew "helmfile"
brew "just"
brew "k9s"
brew "kopia"
brew "krew"
brew "kubernetes-cli"
brew "kustomize"
brew "mdbook"
# brew "minio-mc"
brew "php"
brew "pnpm"
brew "postgresql@17"
brew "protobuf"
brew "qrencode"
brew "redis"
brew "restic"
brew "rsync"
brew "rustup"
brew "sccache"
brew "stern"
brew "talosctl"
brew "zig"

brew "ghcup"
# brew "ghc"
# brew "cabal-install"
# brew "haskell-stack"
# brew "haskell-language-server"

brew "fluxcd/tap/flux"
brew "waydabber/betterdisplay/betterdisplaycli"

cask "adobe-acrobat-reader"
cask "adobe-creative-cloud"
cask "alfred"
cask "alt-tab"
cask "arq"
cask "autodesk-fusion"
cask "bartender"
cask "betterdisplay"
cask "caldigit-docking-utility"
cask "calibre"
cask "devonthink"
cask "discord"
cask "fujitsu-scansnap-home"
cask "ghostty"
cask "google-chrome"
cask "google-drive"
cask "hazel"
cask "iina"
cask "jetbrains-toolbox"
cask "keyboard-maestro"
cask "kopiaui"
cask "logi-options+"
cask "mqttx"
cask "navigraph-charts"
cask "navigraph-simlink"
cask "obsidian"
cask "parallels"
cask "plex"
cask "private-internet-access"
cask "prusaslicer"
cask "raspberry-pi-imager"
cask "rectangle-pro"
cask "sonos"
cask "spotify"
# cask "switchresx"
cask "visual-studio-code"
cask "vnc-viewer"
cask "wezterm"
cask "wireshark-app"
cask "yubico-authenticator"
cask "zed"
cask "zoom"

mas "1Password for Safari", id: 1569813296
mas "Amphetamine", id: 937984704
mas "AutoMounter", id: 1160435653
mas "Drafts", id: 1435957248
mas "FLAC MP3 Converter", id: 982124349
mas "forScore", id: 363738376
mas "GarageBand", id: 682658836
mas "iMovie", id: 408981434
mas "iReal Pro", id: 409035833
mas "Keymapp", id: 6472865291
mas "Keynote", id: 409183694
mas "Logic Pro", id: 634148309
mas "Numbers", id: 409203825
mas "OmniFocus", id: 1542143627
mas "Pages", id: 409201541
mas "Printer Friendly for Safari", id: 1584975882
mas "Slack", id: 803453959
mas "Spark Desktop", id: 6445813049
mas "WireGuard", id: 1451685025
mas "Xcode", id: 497799835
mas "WhatsApp", id: 310633997
{{ end }}

{{- if .workMachine }}

tap "withgraphite/tap"

brew "bacon"
brew "bacon-ls"
brew "docker"
brew "docker-compose"
brew "docker-credential-helper"
brew "docker-credential-helper-ecr"
brew "gitleaks"
brew "withgraphite/tap/graphite"
brew "mysql-client"
brew "pipx"
brew "pyenv"

cask "ghostty"
cask "alfred"
cask "betterdisplay"
cask "cursor"
cask "jetbrains-toolbox"
cask "rancher"
cask "rectangle-pro"
cask "temurin@21"
cask "trunk-io"

mas "Drafts", id: 1435957248
{{- end }}

{{ if .homeMachine }}
{{ if (eq .chezmoi.os "darwin") }}
vscode "aaron-bond.better-comments"
vscode "alefragnani.bookmarks"
vscode "alefragnani.project-manager"
{{- if .vscode.neovim }}
vscode "asvetliakov.vscode-neovim"
{{- end }}
vscode "belfz.search-crates-io"
vscode "bierner.markdown-mermaid"
vscode "blueglassblock.better-json5"
vscode "bmalehorn.vscode-fish"
vscode "davidanson.vscode-markdownlint"
vscode "donjayamanne.githistory"
vscode "dracula-theme-pro.theme-dracula-pro"
vscode "esbenp.prettier-vscode"
vscode "fcrespo82.markdown-table-formatter"
vscode "fill-labs.dependi"
vscode "fnando.linter"
vscode "foxundermoon.shell-format"
vscode "golang.go"
vscode "gruntfuggly.todo-tree"
# vscode "hashicorp.terraform"
vscode "ieni.glimpse"
vscode "JohnnyMorganz.stylua"
vscode "mhutchie.git-graph"
vscode "mikestead.dotenv"
vscode "mrmlnc.vscode-json5"
# vscode "ms-azuretools.vscode-docker"
# vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-playwright.playwright"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
# vscode "ms-vscode-remote.remote-containers"
# vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-ssh"
# vscode "ms-vscode.remote-explorer"
vscode "pkief.material-icon-theme"
vscode "redhat.vscode-yaml"
vscode "rust-lang.rust-analyzer"
vscode "samuelcolvin.jinjahtml"
vscode "signageos.signageos-vscode-sops"
vscode "svelte.svelte-vscode"
vscode "tamasfe.even-better-toml"
vscode "tobias-z.vscode-harpoon"
vscode "usernamehw.errorlens"
vscode "vadimcn.vscode-lldb"
vscode "visualjj.visualjj"
vscode "yzhang.markdown-all-in-one"
vscode "ziglang.vscode-zig"
{{ end }}
{{ end }}
