# Do not edit this file in ~/.config/homebrew/Brewfile. Edit the version in chezmoi source.
#

tap "fluxcd/tap"
tap "homebrew/bundle"

brew "chezmoi"
brew "gnupg"
brew "pinentry-mac"

brew "fluxcd/tap/flux"

cask "1password"
cask "1password-cli"
cask "visual-studio-code"

vscode "aaron-bond.better-comments"
vscode "alefragnani.bookmarks"
vscode "alefragnani.project-manager"
vscode "belfz.search-crates-io"
vscode "bierner.markdown-mermaid"
vscode "bmalehorn.vscode-fish"
vscode "davidanson.vscode-markdownlint"
vscode "donjayamanne.githistory"
vscode "dracula-theme-pro.theme-dracula-pro"
vscode "esbenp.prettier-vscode"
vscode "fcrespo82.markdown-table-formatter"
vscode "fill-labs.dependi"
vscode "fnando.linter"
vscode "foxundermoon.shell-format"
vscode "golang.go"
vscode "gruntfuggly.todo-tree"
vscode "hashicorp.terraform"
vscode "ieni.glimpse"
vscode "jnoortheen.nix-ide"
vscode "kamadorueda.alejandra"
vscode "mhutchie.git-graph"
vscode "mikestead.dotenv"
vscode "mrmlnc.vscode-json5"
vscode "ms-azuretools.vscode-docker"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-playwright.playwright"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.remote-explorer"
vscode "pkief.material-icon-theme"
vscode "redhat.vscode-yaml"
vscode "rust-lang.rust-analyzer"
vscode "samuelcolvin.jinjahtml"
vscode "signageos.signageos-vscode-sops"
vscode "svelte.svelte-vscode"
vscode "tamasfe.even-better-toml"
vscode "usernamehw.errorlens"
vscode "vadimcn.vscode-lldb"
vscode "yinfei.luahelper"
vscode "yzhang.markdown-all-in-one"
