# Do not edit this file in ~/.config/homebrew/Brewfile. Edit the version in chezmoi source.
#

tap "arl/arl"
tap "fluxcd/tap"
tap "hashicorp/tap"
tap "homebrew/bundle"
tap "jesseduffield/lazygit"

brew "age"
brew "ansible"
brew "atuin"
brew "bat"
brew "chezmoi"
brew "cilium-cli"
brew "coreutils"
brew "curl"
brew "direnv"
brew "doggo"
brew "duf"
brew "eza"
brew "fd"
brew "findutils"
brew "fish"
brew "fisher"
brew "fzf"
brew "gawk"
brew "gh"
brew "git"
brew "git-delta"
brew "gnu-sed"
brew "go"
brew "gopls"
brew "go-task"
brew "gpg2"
brew "helm-ls"
brew "helm"
brew "helmfile"
brew "jq"
brew "k9s"
brew "kubernetes-cli"
brew "krew"
brew "lua-language-server"
brew "mas"
brew "mdbook"
brew "minijinja-cli"
brew "minio-mc"
brew "neovim"
brew "php"
brew "pinentry-mac"
brew "pnpm"
brew "postgresql@17"
brew "pre-commit"
brew "prettier"
brew "protobuf"
brew "qrencode"
brew "redis"
brew "restic"
brew "ripgrep"
brew "rustup"
brew "sccache"
brew "sesh"
brew "shellcheck"
brew "sops"
brew "starship"
brew "stern"
brew "stylua"
brew "talhelper"
brew "talosctl"
brew "tmux"
brew "tpm"
brew "watch"
brew "wget"
brew "yamllint"
brew "yq"
brew "zig"
brew "zoxide"

brew "arl/arl/gitmux"
brew "fluxcd/tap/flux"
brew "hashicorp/tap/terraform"
brew "jesseduffield/lazygit/lazygit"

cask "1password"
cask "1password-cli"
cask "font-dejavu-sans-mono-nerd-font"
cask "font-fira-code-nerd-font"
cask "font-jetbrains-mono-nerd-font"
cask "font-sf-mono"
cask "visual-studio-code"

{{ if (eq .chezmoi.hostname "Odin") }}
cask "adobe-acrobat-reader"
cask "adobe-creative-cloud"
cask "alfred"
cask "arc"
cask "arq"
cask "autodesk-fusion"
cask "bartender"
# cask "bettertouchtool"
cask "caldigit-docking-utility"
cask "calibre"
cask "devonthink"
cask "discord"
cask "fujitsu-scansnap-home"
cask "ghostty"
cask "google-chrome"
cask "google-drive"
cask "hazel"
cask "iina"
cask "jetbrains-toolbox"
cask "keyboard-maestro"
cask "lens"
cask "logi-options+"
cask "navigraph-charts"
cask "navigraph-simlink"
cask "obsidian"
cask "parallels"
cask "plex"
cask "private-internet-access"
cask "raspberry-pi-imager"
cask "rectangle-pro"
cask "sonos"
cask "spotify"
cask "switchresx"
cask "ultimaker-cura"
cask "vnc-viewer"
cask "wezterm"
cask "wireshark"
cask "yubico-authenticator"
cask "zoom"

mas "1Password for Safari", id: 1569813296
mas "Amphetamine", id: 937984704
mas "AutoMounter", id: 1160435653
mas "Drafts", id: 1435957248
mas "FLAC MP3 Converter", id: 982124349
mas "forScore", id: 363738376
mas "GarageBand", id: 682658836
mas "iMovie", id: 408981434
mas "iReal Pro", id: 409035833
mas "Keymapp", id: 6472865291
mas "Keynote", id: 409183694
mas "Logic Pro", id: 634148309
mas "Numbers", id: 409203825
mas "OmniFocus", id: 1542143627
mas "Pages", id: 409201541
mas "Slack", id: 803453959
mas "Spark Desktop", id: 6445813049
mas "WireGuard", id: 1451685025
mas "Xcode", id: 497799835
mas "WhatsApp", id: 310633997
{{ end }}

vscode "aaron-bond.better-comments"
vscode "alefragnani.bookmarks"
vscode "alefragnani.project-manager"
vscode "asvetliakov.vscode-neovim"
vscode "belfz.search-crates-io"
vscode "bierner.markdown-mermaid"
vscode "bmalehorn.vscode-fish"
vscode "davidanson.vscode-markdownlint"
vscode "donjayamanne.githistory"
vscode "dracula-theme-pro.theme-dracula-pro"
vscode "esbenp.prettier-vscode"
vscode "fcrespo82.markdown-table-formatter"
vscode "fill-labs.dependi"
vscode "fnando.linter"
vscode "foxundermoon.shell-format"
vscode "golang.go"
vscode "gruntfuggly.todo-tree"
vscode "hashicorp.terraform"
vscode "ieni.glimpse"
vscode "jnoortheen.nix-ide"
vscode "JohnnyMorganz.stylua"
vscode "kamadorueda.alejandra"
vscode "mhutchie.git-graph"
vscode "mikestead.dotenv"
vscode "mrmlnc.vscode-json5"
vscode "ms-azuretools.vscode-docker"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-playwright.playwright"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode.remote-explorer"
vscode "pkief.material-icon-theme"
vscode "redhat.vscode-yaml"
vscode "rust-lang.rust-analyzer"
vscode "samuelcolvin.jinjahtml"
vscode "signageos.signageos-vscode-sops"
vscode "svelte.svelte-vscode"
vscode "tamasfe.even-better-toml"
vscode "tobias-z.vscode-harpoon"
vscode "usernamehw.errorlens"
vscode "vadimcn.vscode-lldb"
vscode "yzhang.markdown-all-in-one"
vscode "ziglang.vscode-zig"
