tap "1password/tap"
tap "armosec/kubescape"
tap "fluxcd/tap"
tap "go-task/tap"
tap "hashicorp/tap"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
brew "age"
brew "ansible"
brew "openjdk@11"
brew "bazel"
brew "cilium-cli"
brew "cmake"
brew "curl"
brew "emacs"
brew "fd"
brew "git"
brew "git-gui"
brew "go"
brew "helm"
brew "jq"
brew "k3d"
brew "kind"
brew "kubernetes-cli"
brew "kubescape"
brew "kustomize"
brew "minikube"
brew "minio-mc"
brew "mysql-client"
brew "openjdk"
brew "pgcli"
brew "pre-commit"
brew "prettier"
brew "ripgrep"
brew "shellcheck"
brew "sops"
brew "velero"
brew "watch"
brew "wget"
brew "yq"
brew "fluxcd/tap/flux"
brew "go-task/tap/go-task"
brew "hashicorp/tap/terraform"
cask "1password-cli"
cask "iina"
